Public Attributes | List of all members
API_AssemblySegmentProfileData Struct Reference
Element Manager
Represents an segment of the beam element. More...
#include <APIdefs_Elements.h>
 Public Attributes
 UInt32  | segmentIndex
Index of the segment.
 ProfileVectorImage *  | customOrigProfile
Original custom profile.
 ProfileVectorImage *  | stretchedProfile
Stretched profile.
Detailed Description
Represents an segment of the beam element.